<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class BanksTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $banks = [
            [
                'hours' => "8:30 - 13:30",
                'location' => "33.4986997, 36.245859",
                'name' => "بنك الدم المركزي",
                'phoneNumber' => "0116619864 - 0116615499",
                'place' => "دمشق - المزة - طلعة الإسكان",
            ],
            [
                'hours' => "9:00 - 13:00",
                'location' => "32.6172451, 36.0905717",
                'name' => "بنك دم درعا",
                'phoneNumber' => "0152216014",
                'place' => "درعا - القادسية",
            ],
            [
                'hours' => "9:00 - 13:00",
                'location' => "32.6938016, 36.5737763",
                'name' => "بنك دم السويداء",
                'phoneNumber' => "016233945",
                'place' => "السويداء - الكورنيش الجنوبي",
            ],
            [
                'hours' => "9:00 - 13:00",
                'location' => "37.0498634, 41.2317281",
                'name' => "بنك دم القامشلي",
                'phoneNumber' => "052440314",
                'place' => "الحكسة - القامشلي - دوار سيفان",
            ],
            [
                'hours' => "8:00 - 15:00",
                'location' => "35.0146551, 37.0439505",
                'name' => "بنك دم السلمية",
                'phoneNumber' => "0338833934",
                'place' => "حمص - السلمية - شارع حماة",
            ],
            [
                'hours' => "8:00 - 15:00",
                'location' => "35.3756622, 35.9238613",
                'name' => "المشفى الوطني بجبلة",
                'phoneNumber' => "0418837660",
                'place' => "اللاذقية - جبلة - ضاحية الأسد",
            ],
            [
                'hours' => "9:00 - 13:00",
                'location' => "35.4698587, 36.0710958",
                'name' => "مشفى الباسل في القرداحة",
                'phoneNumber' => "0416611939",
                'place' => "اللاذقية - القرداحة",
            ],
            [
                'hours' => "8:00 - 15:00",
                'location' => "36.5075671, 40.7592134",
                'name' => "المشفى الوطني بالحسكة",
                'phoneNumber' => "052312777",
                'place' => "الحسكة - العزيزية",
            ],
            [
                'hours' => "9:00 - 13:00",
                'location' => "35.0250367, 40.453043",
                'name' => "بنك دم دير الزور",
                'phoneNumber' => "0944260352",
                'place' => "دير الزور - الميادين - مسجد الغرب",
            ],
            [
                'hours' => "8:00 - 15:00",
                'location' => "35.0702018, 36.3515026",
                'name' => "مشفى مصياف الوطني",
                'phoneNumber' => "0337705465",
                'place' => "طرطوس - مصياف",
            ],
            [
                'hours' => "8:00 - 15:00",
                'location' => "34.026542, 36.714369",
                'name' => "مشفى القلمون في النبك",
                'phoneNumber' => "0117231872",
                'place' => "دمشق - النبك - طريق السفر",
            ],
            [
                'hours' => "9:00 - 13:00",
                'location' => "33.5126953, 36.2588983",
                'name' => "بنك الدم تشرين",
                'phoneNumber' => "0115160061",
                'place' => "دمشق - المواساة - شارع 7 نيسان",
            ],
            [
                'hours' => "9:00 - 13:00",
                'location' => "33.5669409, 36.3917964",
                'name' => "بنك دم دوما",
                'phoneNumber' => "00000000",
                'place' => "دمشق - دوما - جسر المشاة",
            ],
            [
                'hours' => "8:00 - 15:00",
                'location' => "33.5066694, 36.2651534",
                'name' => "مشفى الأسد الجامعي",
                'phoneNumber' => "0116612537 - 0112126500",
                'place' => "دمشق - المزة - شارع فايز منصور",
            ],
            [
                'hours' => "8:00 - 15:00",
                'location' => "36.2207501, 37.149024",
                'name' => "بنك دم حلب",
                'phoneNumber' => "0212255558 - 0212340777",
                'place' => "حلب - الأشرقية - شارع حطين",
            ],
            [
                'hours' => "9:00 - 13:00",
                'location' => "35.1247567, 36.7690804",
                'name' => "بنك دم حماة",
                'phoneNumber' => "0332539000",
                'place' => "حماة - شارع الأحداث",
            ],
            [
                'hours' => "8:00 - 15:00",
                'location' => "34.7464292, 36.6869802",
                'name' => "بنك دم حمص",
                'phoneNumber' => "0312521499 - 0312521399",
                'place' => "حمص - الوعر - شارع نزار القباني",
            ],
            [
                'hours' => "8:00 - 15:00",
                'location' => "35.506979, 35.7717282",
                'name' => "بنك دم اللاذقية",
                'phoneNumber' => "0412575080",
                'place' => "اللاذقية - شارع الجزائر",
            ],
            [
                'hours' => "9:00 - 13:00",
                'location' => "34.9022274, 35.8987907",
                'name' => "بنك دم طرطوس",
                'phoneNumber' => "0432444049 - 0432442101",
                'place' => "طرطوس - دوار المشفى العسكري",
            ],
        ];

        // إدخال البيانات إلى الجدول
        DB::table('banks')->insert($banks);
    }
}
